tap "abhinav/tap"
tap "hashicorp/tap"
tap "ngrok/ngrok"
tap "peak/tap"

brew "atuin"
brew "ast-grep"
brew "bat"
brew "btop"
brew "ccusage"
brew "chezmoi"
brew "clang-format"
brew "difftastic"
brew "direnv"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-absorb"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "glow"
brew "go"
brew "gum"
brew "hyperfine"
brew "jj"
brew "just"
brew "jq"
brew "lazygit"
brew "macos-trash"
brew "mise"
brew "neovim"
brew "node"
brew "openjdk@11"
brew "pipx"
brew "procs"
brew "python@3.12"
brew "ripgrep"
brew "rtk"
brew "sd"
brew "sesh"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stylua"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "tree-sitter-cli"
brew "uv"
brew "watch"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "codex"
cask "cursor"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "git-spice"
cask "session-manager-plugin"
cask "wezterm"
